Cylinder_Flow_elongated_RhoPimple/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField uniform 101325;

boundaryField
{

    wall
    {
        type            zeroGradient;
    }

    inlet
    {
        type fixedValue;
        value uniform 101325.05;
    }
    outlet
    {
        type fixedValue;
        value uniform 101325;
    }
}

// ************************************************************************* //
