Cylinder_Flow_elongated_RhoPimple/CFD/system/blockMeshDict
// ************************************************************************* //


/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// ---------------- GEOMETRY ----------------

drum_t     0.189;     // cylinder length
R          0.0515;    // cylinder radius
struc_por  0.4;       // structured core fraction
eps 0.001;

// ---------------- MESH --------------------

nx         200;       // axial cells
nr         30;        // radial cells
ns         20;        // structured core cells

// ------------------------------------------

core       #calc "$R*$struc_por";

wedgeAngle 45;
angleRad   #calc "degToRad($wedgeAngle)";
pos        #calc "$R*cos($angleRad)";

// axial positions
xlo        #calc "-$eps";
xhi        #calc "$drum_t + $eps";

// ************************************************************************* //
// Geometry
//
//              z
//              ↑
//
//         7 -------- 1
//         |          |
//         |  0----3  |
//         |  |    |  |
//         |  6----5  |
//         |          |
//         4 -------- 2
//
//                  → y
//
// x = xlo plane : 0-7
// x = xhi plane : 8-15
//
// ************************************************************************* //

vertices
(
    // inlet plane (x = xlo)

    ($xlo  $core   $core)                              // 0
    ($xlo  $pos    $pos)                               // 1
    ($xlo  $pos   #calc "-$pos")                       // 2
    ($xlo  $core  #calc "-$core")                      // 3

    ($xlo #calc "-$pos"   #calc "-$pos")               // 4
    ($xlo #calc "-$core"  #calc "-$core")              // 5
    ($xlo #calc "-$core"   $core)                      // 6
    ($xlo #calc "-$pos"    $pos)                       // 7


    // outlet plane (x = xhi)

    ($xhi  $core   $core)                              // 8
    ($xhi  $pos    $pos)                               // 9
    ($xhi  $pos   #calc "-$pos")                       // 10
    ($xhi  $core  #calc "-$core")                      // 11

    ($xhi #calc "-$pos"   #calc "-$pos")               // 12
    ($xhi #calc "-$core"  #calc "-$core")              // 13
    ($xhi #calc "-$core"   $core)                      // 14
    ($xhi #calc "-$pos"    $pos)                       // 15
);


blocks
(
    // outer ring blocks

    hex (1 0 3 2 9 8 11 10)
        ($nr $ns $nx)
        simpleGrading (6 1 1)

    hex (2 3 5 4 10 11 13 12)
        ($nr $ns $nx)
        simpleGrading (6 1 1)

    hex (4 5 6 7 12 13 14 15)
        ($nr $ns $nx)
        simpleGrading (6 1 1)

    hex (7 6 0 1 15 14 8 9)
        ($nr $ns $nx)
        simpleGrading (6 1 1)

    // center block

    hex (0 6 5 3 8 14 13 11)
        ($ns $ns $nx)
        simpleGrading (1 1 1)
);

edges
(
    // inlet arcs

    arc 1 2   ($xlo  $R   0)
    arc 2 4   ($xlo   0  #calc "-$R")
    arc 4 7   ($xlo #calc "-$R"   0)
    arc 7 1   ($xlo   0   $R)

    // outlet arcs

    arc 9 10  ($xhi  $R   0)
    arc 10 12 ($xhi   0  #calc "-$R")
    arc 12 15 ($xhi #calc "-$R"   0)
    arc 15 9  ($xhi   0   $R)
);

boundary
(
    inlet
    {
        type patch;

        faces
        (
            (1 0 3 2)
            (2 3 5 4)
            (4 5 6 7)
            (7 6 0 1)
            (0 6 5 3)
        );
    }


    outlet
    {
        type patch;

        faces
        (
            (9 8 11 10)
            (10 11 13 12)
            (12 13 14 15)
            (15 14 8 9)
            (8 14 13 11)
        );
    }


    wall
    {
        type wall;

        faces
        (
            (1 9 10 2)
            (2 10 12 4)
            (4 12 15 7)
            (7 15 9 1)
        );
    }
);

// ************************************************************************* //
